Задача 42: Узнать какая максимальная households в зоне минимального значения population.

 print(f'Mаксимальная households в зоне минимального значения population = {df.describe().min().households}')
 Cредняя стоимость дома, где кол-во людей от 0 до 500 (population): 206683.83635227982
 Mаксимальная households в зоне минимального значения population = 1.0